Revit 2026 API

# StructuralAssetMinimumTensileStrength Property

---

The minimum tensile strength of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double MinimumTensileStrength { get; set; }
```
```vb
Public Property MinimumTensileStrength As Double
	Get
	Set
```
```cpp
public:
property double MinimumTensileStrength {
	double get ();
	void set (double value);
}
```
```fsharp
member MinimumTensileStrength : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be Metal or generic to set this property. |

Applies to Metal-based and generic structural assets. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace